In [49]:
import pandas as pd

df_flight = pd.read_csv("Customer Flight Activity (1).csv",index_col=0)
df_customer = pd.read_csv("Customer Loyalty History.csv",index_col=0)

In [50]:
#para la exploración de la estructura de datos, veo las primeras filas del dataset para ver el tipo de datos y su estructuram por ejemplo, vi que el indice era 0,1,2 y añadi index_col)

df_flight.head()

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
Loyalty Number,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0
100102,2017,1,10,4,14,2030,203.0,0,0
100140,2017,1,6,0,6,1200,120.0,0,0
100214,2017,1,0,0,0,0,0.0,0,0
100272,2017,1,0,0,0,0,0.0,0,0

In [51]:
#veo la estructura general de cada tabla

df_flight.info()

<class 'pandas.core.frame.DataFrame'>
Index: 405624 entries, 100018 to 999986
Data columns (total 9 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Year                         405624 non-null  int64
 1   Month                        405624 non-null  int64
 2   Flights Booked               405624 non-null  int64
 3   Flights with Companions      405624 non-null  int64
 4   Total Flights                405624 non-null  int64
 5   Distance                     405624 non-null  int64
 6   Points Accumulated           405624 non-null  float64
 7   Points Redeemed              405624 non-null  int64
 8   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(8)
memory usage: 30.9 MB

In [52]:
#Chequeo primero una tabla y luego la otra
#Revisar si hay valores nulos 

df_flight.isnull().sum() # me dan 0 valores nulos en la salida

#Chequeo si hay valores atípicos

df_flight.describe().T

#no hay valores nulos tambien porque el count me da lo mismo para todas las variables del dataset
#Identifico outliers. para identificarlos y entenderlos

,count,mean,std,min,25%,50%,75%,max
Year,405624.0,2017.500000,0.500001,2017.0,2017.00,2017.5,2018.00,2018.0
Month,405624.0,6.500000,3.452057,1.0,3.75,6.5,9.25,12.0
Flights Booked,405624.0,4.115052,5.225518,0.0,0.00,1.0,8.00,21.0
Flights with Companions,405624.0,1.031805,2.076869,0.0,0.00,0.0,1.00,11.0
Total Flights,405624.0,5.146858,6.521227,0.0,0.00,1.0,10.00,32.0
Distance,405624.0,1208.880059,1433.155320,0.0,0.00,488.0,2336.00,6293.0
Points Accumulated,405624.0,123.692721,146.599831,0.0,0.00,50.0,239.00,676.5
Points Redeemed,405624.0,30.696872,125.486049,0.0,0.00,0.0,0.00,876.0
Dollar Cost Points Redeemed,405624.0,2.484503,10.150038,0.0,0.00,0.0,0.00,71.0

In [53]:
df_customer.info() #veo la estructura general de la tabla

<class 'pandas.core.frame.DataFrame'>
Index: 16737 entries, 480934 to 652627
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Country             16737 non-null  object
 1   Province            16737 non-null  object
 2   City                16737 non-null  object
 3   Postal Code         16737 non-null  object
 4   Gender              16737 non-null  object
 5   Education           16737 non-null  object
 6   Salary              12499 non-null  float64
 7   Marital Status      16737 non-null  object
 8   Loyalty Card        16737 non-null  object
 9   CLV                 16737 non-null  float64
 10  Enrollment Type     16737 non-null  object
 11  Enrollment Year     16737 non-null  int64
 12  Enrollment Month    16737 non-null  int64
 13  Cancellation Year   2067 non-null   float64
 14  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(2), object(9)
memory usage: 2.0+ MB

In [54]:
df_customer.head() #igual en la otra, voy viendo valores NaN

,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
Loyalty Number,,,,,,,,,,,,,,,
480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [55]:
df_customer.isnull().sum()  # Ver nulos, salary, cancelation year y cancellation month

Country                   0
Province                  0
City                      0
Postal Code               0
Gender                    0
Education                 0
Salary                 4238
Marital Status            0
Loyalty Card              0
CLV                       0
Enrollment Type           0
Enrollment Year           0
Enrollment Month          0
Cancellation Year     14670
Cancellation Month    14670
dtype: int64

In [57]:
df_customer.describe().T

,count,mean,std,min,25%,50%,75%,max
Salary,12499.0,79245.609409,35008.297285,-58486.00,59246.50,73455.00,88517.50,407228.00
CLV,16737.0,7988.896536,6860.982280,1898.01,3980.84,5780.18,8940.58,83325.38
Enrollment Year,16737.0,2015.253211,1.979111,2012.00,2014.00,2015.00,2017.00,2018.00
Enrollment Month,16737.0,6.669116,3.398958,1.00,4.00,7.00,10.00,12.00
Cancellation Year,2067.0,2016.503145,1.380743,2013.00,2016.00,2017.00,2018.00,2018.00
Cancellation Month,2067.0,6.962748,3.455297,1.00,4.00,7.00,10.00,12.00

In [58]:
#salary
#relleno con la mediana

df_customer["Salary"] = df_customer["Salary"].fillna(73455)

#dado que el 25% tienen salarios en torno al 59246, doi por hecho que el minimo es un error de entrada y lo cambio a positivo

df_customer["Salary"] = df_customer["Salary"].abs()

In [59]:
#cancellation year y cancelation month

#cambio NaN por 0 para decir que el cliente sigue activo

df_customer["Cancellation Year"] = df_customer["Cancellation Year"].fillna(0)
df_customer["Cancellation Month"] = df_customer["Cancellation Month"].fillna(0)

# Convertir a entero para eliminar decimales
df_customer["Cancellation Year"] = df_customer["Cancellation Year"].astype(int)
df_customer["Cancellation Month"] = df_customer["Cancellation Month"].astype(int)

In [60]:
#unimos los datos de la forma mas eficiente, que será por Loyalty number ya que actua como un ID

df_merged = pd.merge(df_flight, df_customer, on="Loyalty Number", how="outer")

In [61]:
#verificar nulos despues de la fusión

df_merged.isnull().sum()

Year                           0
Month                          0
Flights Booked                 0
Flights with Companions        0
Total Flights                  0
Distance                       0
Points Accumulated             0
Points Redeemed                0
Dollar Cost Points Redeemed    0
Country                        0
Province                       0
City                           0
Postal Code                    0
Gender                         0
Education                      0
Salary                         0
Marital Status                 0
Loyalty Card                   0
CLV                            0
Enrollment Type                0
Enrollment Year                0
Enrollment Month               0
Cancellation Year              0
Cancellation Month             0
dtype: int64

In [62]:
#revisar tipo de datos en cada columna

df_merged.dtypes

Year                             int64
Month                            int64
Flights Booked                   int64
Flights with Companions          int64
Total Flights                    int64
Distance                         int64
Points Accumulated             float64
Points Redeemed                  int64
Dollar Cost Points Redeemed      int64
Country                         object
Province                        object
City                            object
Postal Code                     object
Gender                          object
Education                       object
Salary                         float64
Marital Status                  object
Loyalty Card                    object
CLV                            float64
Enrollment Type                 object
Enrollment Year                  int64
Enrollment Month                 int64
Cancellation Year                int64
Cancellation Month               int64
dtype: object

In [69]:
#convertir a category, gender, marital status y education

# Convertir las columnas seleccionadas a category
categorical_cols = ["Gender", "Marital Status", "Education"]
df_merged[categorical_cols] = df_merged[categorical_cols].astype("category")

In [70]:
df_merged.dtypes

Year                              int64
Month                             int64
Flights Booked                    int64
Flights with Companions           int64
Total Flights                     int64
Distance                          int64
Points Accumulated              float64
Points Redeemed                   int64
Dollar Cost Points Redeemed       int64
Country                          object
Province                         object
City                             object
Postal Code                      object
Gender                         category
Education                      category
Salary                          float64
Marital Status                 category
Loyalty Card                     object
CLV                             float64
Enrollment Type                  object
Enrollment Year                   int64
Enrollment Month                  int64
Cancellation Year                 int64
Cancellation Month                int64
dtype: object

In [72]:
import matplotlib.pyplot as plt
import seaborn as sns